window_open/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    door
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          368;
        startFace       236159;
    }
    window
    {
        type            patch;
        nFaces          50;
        startFace       236527;
    }
    fan
    {
        type            patch;
        nFaces          10;
        startFace       236577;
    }
    constraint
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          4117;
        startFace       236587;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8992;
        startFace       240704;
    }
    defaultFaces
    {
        type            patch;
        nFaces          0;
        startFace       249696;
    }
)

// ************************************************************************* //
