window_open/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 83333.33333333334;

boundaryField
{

    door
    {
        type        zeroGradient;
    }

    window
    {
        type        totalPressure;
        p0          uniform 83333.33333333334;
        value       $internalField;
    }

    fan
    {
        type        zeroGradient;
    }

    constraint
    {
        type        symmetry;
        value       $internalField;
    }

    wall
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
