window_open/system/alphaDivScheme
div(phi,alpha) Gauss vanLeer;
